global flexion_arr
flexion_arr = ('а', 'ам', 'ами', 'ас', 'ах', 'ая', 'е', 'её', 'ей', 'ем', 'ла', 
                       'еми', 'емя', 'ex', 'ею', 'ёт', 'ёте', 'ёх', 'ёшь', 'и', 'ие',  
                       'ий', 'им', 'ими', 'ит', 'ите', 'их', 'ишь', 'ию', 'ми', 'мя', 'о',  
                       'ов', 'ого', 'ое', 'ой', 'ом', 'ому', 'ою', 'у', 'ум', 'умя', 'ут', 'ух', 
                       'ую', 'шь', 'ать', 'ять', 'еть', 'уть', 'у', 'ю', 'ем', 'ешь', 'ете', 'ет',
                       'ут', 'ют', 'ал', 'ял', 'ала', 'яла', 'али', 'яли', 'ул', 'ула', 'ули')
def GetMaxLen():
    global maxlen
    maxlen = flexion_arr[0]
    for flex in flexion_arr:
        if len(flex) > len(maxlen):
            maxlen = flex
    return maxlen
    maxlen = len(maxlen)
